[{"code":[],"body":"Rails follows a shifted version of semver:Patch ZOnly bug fixes, no API changes, no new features.\nExcept as necessary for security fixes.Minor YNew features, may contain API changes (Serve as major versions of Semver).\nBreaking changes are paired with deprecation notices in the previous minor\nor major release.Major XNew features, will likely contain API changes. The difference between Rails'\nminor and major releases is the magnitude of breaking changes, and usually\nreserved for special occasions.New features are only added to the main branch and will not be made available\nin point releases.","title":"1 New Features","anchor":"#new-features"},{"title":"2 Bug Fixes","anchor":"#bug-fixes","code":[],"body":"Only the latest release series will receive bug fixes. When enough bugs are\nfixed and its deemed worthy to release a new gem, this is the branch it happens\nfrom.In special situations, where someone from the Core Team agrees to support more series,\nthey are included in the list of supported series.Currently included series: 6.1.Z."},{"title":"3 Security Issues","anchor":"#security-issues","code":[],"body":"The current release series and the next most recent one will receive patches\nand new versions in case of a security issue.These releases are created by taking the last released version, applying the\nsecurity patches, and releasing. Those patches are then applied to the end of\nthe x-y-stable branch. For example, a theoretical 1.2.2.1 security release would\nbe built from 1.2.2, and then added to the end of 1-2-stable. This means that\nsecurity releases are easy to upgrade to if you're running the latest version\nof Rails.Currently included series: 6.1.Z, 6.0.Z, 5.2.Z."},{"title":"4 Severe Security Issues","anchor":"#severe-security-issues","code":[],"body":"For severe security issues all releases in the current major series, and also the\nlast release in the previous major series will receive patches and new versions. The\nclassification of the security issue is judged by the core team.Currently included series: 6.1.Z, 6.0.Z, 5.2.Z."},{"title":"5 Unsupported Release Series","anchor":"#unsupported-release-series","code":[],"body":"When a release series is no longer supported, it's your own responsibility to\ndeal with bugs and security issues. We may provide backports of the fixes and\npublish them to git, however there will be no new versions released. If you are\nnot comfortable maintaining your own versions, you should upgrade to a\nsupported version."}]